{
    "title": "Our Work",
    "items": [
        {
            "title": "Bookshelves",
            "category": "Residential",
            "description": "Floating vanity with natural wood finish and marble countertop.",
            "full_description": "This floating bathroom vanity provides a modern, spacious feel to the bathroom. Crafted from solid oak with a natural oil finish that highlights the wood grain. Features include a marble countertop with an integrated sink, two soft-close drawers, and open shelving for towel storage.",
            "image_url": "\/media\/portfolio-item-6993812a21245.jpg"
        },
        {
            "title": "Custom Vintage Cabinets",
            "category": "Residential",
            "description": "A vintage kitchen restored to its original glory with a little modern pizzazz. ",
            "full_description": "These vintage kitchen cabinets feature a retro style design with a spunky peacock blue finish. We incorporated soft-close hinges and drawers for quiet operation. The custom upgrades include reclaiming the old double oven space for a microwave warming drawer with a custom sized storage underneath. A upgrading the counter height Peninsula to a custom corbel supported barr height feature.",
            "image_url": "\/media\/portfolio-item-699380e9ac169.jpg"
        },
        {
            "title": "Media Cabinet",
            "category": "Commercial",
            "description": "Custom glass display case with integrated lighting for retail store.",
            "full_description": "This retail display case was designed for a jewelry store, featuring tempered glass on all sides for maximum visibility. The integrated LED lighting provides perfect illumination for the products. The case includes locking doors and adjustable glass shelves to accommodate various product sizes.",
            "image_url": "\/media\/portfolio-item-699381402fbca.jpg"
        },
        {
            "title": "Corporate Office Storage",
            "category": "Commercial",
            "description": "Custom built-in cabinets for office with file storage and display shelves.",
            "full_description": "This office storage solution features built-in cabinets that maximize vertical space. The design includes file storage drawers, adjustable shelving for books and decor, and closed cabinets for hiding office supplies. Finished with a rich walnut stain and matte protective coating.",
            "image_url": "https:\/\/images.unsplash.com\/photo-1595428774223-ef52624120d2?ixlib=rb-1.2.1&auto=format&fit=crop&w=600&h=400&q=80"
        },
        {
            "title": "Built-in Bookcase",
            "category": "Specialized",
            "description": "Floor-to-ceiling bookcase with adjustable shelves and cabinet storage.",
            "full_description": "This built-in bookcase transforms an entire wall into a functional storage and display area. Features include adjustable shelves to accommodate books of different sizes, cabinet bases with hidden storage, and crown molding that matches the room's existing trim. Finished with a custom mixed paint color to match the client's decor.",
            "image_url": "https:\/\/i.pinimg.com\/originals\/2c\/f0\/0a\/2cf00acd102e161fa7180d8fe6a91252.png"
        },
        {
            "title": "Custom Shelving Unit",
            "category": "Specialized",
            "description": "Open shelving with custom brackets for displaying unique items.",
            "full_description": "These open shelves provide both functionality and aesthetic appeal. Crafted from reclaimed barn wood with custom forged steel brackets. The shelves are perfect for displaying beautiful dishware while keeping everyday items within easy reach. Finished with a food-safe sealant for durability.",
            "image_url": "https:\/\/images.unsplash.com\/photo-1600566752355-35792bedcfea?ixlib=rb-1.2.1&auto=format&fit=crop&w=600&h=400&q=80"
        }
    ]
}